Repository: 84000/data-translation-memory
Catalog: toh386-v3.tmx
Source language: bo
Languages: en

source: དཔལ་ནམ་མཁའ་དང་མཉམ་པའི་རྒྱུད་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བ།
en: The Glorious King of Tantras Equal to the Sky Equal to the Sky

source: དཔལ་བདེ་བ་ཆེན་པོ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the Glorious Great Blissful One!

source: །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྐུ་དང་གསུང་དང་ཐུགས་རྡོ་རྗེ་བཙུན་མོའི་བྷ་ག་ལ་སྙོམས་པར་བཞུགས་སོ།
en: The Blessed One was dwelling in the bhaga of the vajra queen—the awakened body, speech, and mind of all thus-gone ones.

source: །དེའི་ཚེ་འཁོར་འདུས་པ་དེ་དག་གི་ནང་ནས་མཁའ་སྤྱོད་མ།
en: At that time, present among the assembly were the sky-dwelling, earth-dwelling, and subterranean ḍākinīs.

source: ས་སྤྱོད་མ་དང་། ས་འོག་ན་སྤྱོད་པ་མ་གསུམ་ལ་བཅོམ་ལྡན་འདས་ཀྱིས་ཞལ་འཛུམ་པ་མཛད་དེ། གསང་བའི་དོན་འདི་གསུངས་པ།
en: Smiling at these three, the Blessed One gave this teaching on the secret topic:

source: །དད་ལྡན་སྙིང་རྗེར་ལྡན་དང་རྩེ་གཅིག་སེམས།
en: With faith, compassion, and a one-pointed mind,

source: །ལུས་ངག་གུས་བཅས་གཞན་ལ་ཕན་སེམས་ལྡན།
en: Fix your body and your speech; set your mind toward others’ benefit.

source: །འཇིགས་མེད་བརྟུལ་ཞུགས་ལྡན་ཞིང་ཟབ་མོ་ཡི།
en: Endeavoring toward fearless yogic discipline,

source: །ལམ་ལ་སྤྲོ་བར་གྱིས་ལ་ལེགས་པར་ཉོན།
en: With zeal for the profound path—listen well!

source: །མཁའ་འགྲོ་ཁྱོད་ཀྱི་མཚན་ཉིད་ནི། །ང་ཡིས་ཁྱོད་ལ་བཤད་པར་བྱ།
en: Ḍākinīs, to you I will explain

source: །མཁའ་སྤྱོད་སྟེང་སྒོའི་རླུང་ཡིན་ཏེ།
en: Your distinctive characteristics. Sky dweller is the winds of the upper gate.

source: །ས་སྤྱོད་བར་དུ་ཐིག་ལེའི་སྒོ།
en: Earth dweller is the drops of the middle gate.

source: །ས་འོག་སྤྱོད་པ་ཤུ་ཀྲའི་སྒོ།
en: Subterranean dweller is the lower gate of śukra

source: །སྒོ་གསུམ་སྐུ་གསུང་ཐུགས་ཡིན་ཏེ།
en: These three gates are awakened body, speech, and mind.

source: །དང་པོ་མཁའ་སྤྱོད་མཚན་ཉིད་ཀྱང་།
en: First, the distinctive characteristics of the sky-dwelling ḍākinī

source: །རྣམ་པ་གསུམ་དུ་ཤེས་བྱ་སྟེ།
en: Should be known as being of three types:

source: །བེམས་པོའི་རླུང་དང་རྣམ་རྟོག་རླུང་།
en: The physical wind, the cognitive wind,

source: །ཀུན་གྱི་མཚན་ཉིད་ཡེ་ཤེས་རླུང་།
en: And the wisdom wind, which has the quality of all.

source: །མདོར་བསྟན་དེ་ཉིད་རིམ་པས་དབྱེ།
en: To elaborate on this brief explanation in sequence:

source: །གཉིས་མེད་རླུང་ནི་མ་ནིང་སྟེ།
en: The nondual wind is neither male nor female.

source: །ཟུང་འཇུག་ཐབས་དང་ཤེས་རབ་རླུང་། །ལྡང་འཇུག་སྐུ་གསུང་ཐུགས་ཀྱི་རླུང་།
en: When in union, it is the wind of method and wisdom. When it flows upward and enters, it is awakened body, speech, and mind. It then spreads throughout the body:

source: །སྙིང་དང་གཞང་ཁ་མགྲིན་པ་དང་། །ལྟེ་བ་ལུས་ཀྱིས་ཁྱབ་པ་རུ།
en: the heart, sacrum, Mouth, throat, and navel.

source: །རིགས་ལྔའི་རླུང་ནི་ཁྱབ་པར་གནས།
en: The five families’ winds then abide all-pervasively.

source: །རྒྱུ་བ་བཞི་ནི་འབྱུང་བའི་རླུང་།
en: The physical wind has four circulatory movements.

source: །དངས་སྙིགས་འབྱེད་པ་བརྒྱད་དུ་འགྱུར།
en: Divided into pure or defiled, there are a total of eight.

source: །འདི་ཉིད་རླུང་ནི་ཐུན་བརྒྱད་དེ།
en: Each of these corresponds to one of eight three-hour periods.

source: །ཐུན་རེ་ལ་ནི་འཕོ་བ་གཉིས།
en: Each three-hour period can be divided into two circulations.

source: །རླུང་གི་འཕོ་བ་བཅུ་དྲུག་ཡིན།
en: The circulations of wind are sixteen in number.

source: །འཕོ་བ་གཅིག་ལ་ཆུ་ཚོད་གཉིས།
en: Each circulation takes two hours.

source: །ཆུ་ཚོད་རེ་ལ་དབྱུག་གུ་གཉིས།
en: In each hour, there are two daṇḍas.

source: །རླུང་གི་དབྱུག་གུ་དྲུག་ཅུ་བཞི།
en: In terms of the winds, the daṇḍas number sixty-four.

source: །དེ་བཞིན་ཆུ་ཚོད་སུམ་ཅུ་གཉིས།
en: Similarly, there are thirty-two hours,

source: །ཉི་ཁྲི་ཆིག་སྟོང་དྲུག་བརྒྱ་སོགས།
en: Which can be divided into twenty-one thousand six hundred and so forth.

source: །སེམས་དང་སེམས་མིན་འདྲེས་པའི་རླུང་།
en: These winds are a mix of mental and nonmental.

source: །རགས་པ་དང་ནི་ཕྲ་བ་ལ།
en: In its coarse and subtle aspects,

source: །མཁས་པས་སེམས་ཀྱི་བཞོན་པར་གཟུང་།
en: The wise should take hold of the mount of the mind,

source: །རྣམ་རྟོག་གཟུང་འཛིན་སེམས་ཀྱི་རྟ།
en: The steed of the mind—concepts of grasper and grasped.

source: །གཟུང་འཛིན་གཉིས་འགགས་དབུ་མར་གནས།
en: When these two—grasper and grasped—have ceased, the winds come to rest at the center.

source: །དེ་ཉིད་ཡེ་ཤེས་རྡོ་རྗེའི་རླུང་།
en: By itself, this is the wind of vajra wisdom.

source: །དབྱེ་བ་ཐབས་དང་ཤེས་རབ་གཉིས།
en: When divided it has two aspects, method and wisdom.

source: །འདི་རྣམས་མཁའ་སྤྱོད་རང་བཞིན་ཏེ།
en: It is the nature of the sky-dwelling ḍākinī.

source: །དེ་དག་མན་ངག་མཁས་པས་བརྟག །ཡོན་ཏན་སྐྱོན་དང་རྟགས་རྣམས་ཀྱིས།
en: This should be studied by those who know the pith instructions. By means of their qualities, faults, and indications,

source: །རླུང་གི་མཚན་ཉིད་ཤེས་པར་བྱ།
en: One must know the distinctive characteristics of the winds,

source: །དེ་དག་ཀུན་གྱི་རྟེན་ཉིད་ཀྱང་།
en: Along with all their supports.

source: །གཞོལ་མ་དང་ནི་གཡོན་མ་དང་། །འདི་ནི་གཞུ་ཡི་རྣམ་པར་གནས།
en: There is the “curved one” along with the one on the left. These have the shape of a bow.

source: །བེམས་པོ་རླུང་གི་ལམ་ཡིན་ཏེ།
en: They are the paths of the physical wind.

source: །དབང་པོ་མངོན་སུམ་ལམ་ཡིན་པས།
en: Through the paths of direct sensory perceptions, One should strive diligently to understand

source: །སྣ་ཡི་རི་རབ་གླིང་བཞི་ལ།
en: The various geographical features—Mount Sumeru and the four continents;

source: །ཉི་ཟླ་བྱང་ནུབ་ལྷོར་རྒྱུག་གིས།
en: The sun and moon in the north and west, orbiting to the south;

source: །ཐབས་དང་ཤེས་རབ་སྐོར་སོགས་ལ། །འབད་པས་སེམས་ནི་གཟུང་བར་བྱ།
en: The cycling of method and wisdom, and so forth—

source: །འདི་དག་བེམས་པོས་ཡང་དག་གནས།
en: These are stabilized by the physical wind.

source: །མི་ཤེས་པ་ཡི་རབ་རིབ་ཀྱིས།
en: Due to the cataracts of ignorance,

source: །རིན་ཆེན་སེམས་ནི་དྲི་ཅན་བྱས།
en: The jewel of the mind has become stained.

source: །འདི་ནི་རྣམ་རྟོག་རླུང་ཡིན་ཏེ།
en: This is the conceptual wind;

source: །འདི་ཉིད་ཀྱིས་ནི་ལམ་གྱུར་བ།
en: This wind is itself the path.

source: །རོ་མ་དང་ནི་རྐྱང་མའོ།
en: There are the right channel and left channel,

source: །སྦྲུལ་འཁྱིལ་ལྟ་བུའི་རྣམ་པ་སྟེ།
en: Their forms similar to a coiled snake.

source: །རྣལ་འབྱོར་གྱི་ནི་དམིགས་པའི་ཡུལ།
en: For one who focuses on yoga,

source: །གནས་དེར་རྣམ་རྟོག་རླུང་འགག་གོ།
en: The conceptual winds cease in their place.

source: །རང་རིག་གདོད་ནས་མ་སྐྱེས་པ།
en: Self-awareness, which is primordially unarisen,

source: །འདི་ཉིད་ཡེ་ཤེས་རྡོ་རྗེའི་རླུང་།
en: Is itself the wind of vajra wisdom.

source: །ཀུན་འདར་མ་ཡི་རྩ་ལ་བརྟེན།
en: Supported by the channel in the center,

source: །ཙཎྜཱ་ལཱི་ནི་ཤིང་ལྟ་བུ།
en: Caṇḍālī is like its chariot.

source: །རང་རིག་ཡེ་ཤེས་སྤྱོད་ཡུལ་ཏེ།
en: The domain of its activity is the wisdom of self-awareness.

source: །གནས་དེར་འབད་དེ་རང་རིག་གཟུང་།
en: One who strives to remain there will apprehend self-awareness.

source: །མཁའ་སྤྱོད་རླུང་གི་རང་བཞིན་ཕྱིར།
en: Because the sky-dwelling ḍākinī has the nature of these winds,

source: །འདི་དག་རྡོ་རྗེའི་ལམ་ཡིན་ནོ།
en: They are themselves the vajra path.

source: །དེ་ནས་ས་སྤྱོད་བཤད་བྱ་སྟེ།
en: Next, I will explain the earth-dwelling ḍākinī.

source: །རང་རིག་ཡེ་ཤེས་གང་འདོད་པས།
en: One who desires the wisdom of self-awareness

source: །ཙཎྜཱ་ལཱི་ཡི་བྱེ་བྲག་བརྟག །དང་པོར་རང་བཞིན་ཙཎྜཱ་ལཱི།
en: Should investigate the divisions of caṇḍālī. First is the natural caṇḍālī

source: །གཉིས་པ་གཏུམ་མོ་ཙཎྜཱ་ལཱི།
en: Second is the inner heat caṇḍālī

source: །གསུམ་པ་ཁ་སྦྱར་ཙཎྜཱ་ལཱི།
en: Third is the caṇḍālī of union

source: །དེ་བཞིན་གཅེར་བུའི་ཙཎྜཱ་ལཱི།
en: Likewise, there is the naked caṇḍālī

source: །དེ་ཉིད་ལ་ཡང་དབྱེ་བ་སྟེ།
en: These categories are also subdivided as follows:

source: །གཅེར་བུ་གཏུམ་མོ་ཤིན་ཏུ་གཏུམ།
en: There are naked inner heat , extreme inner heat

source: །ཡང་དག་གཏུམ་མོ་གཞན་སྦྱར་དང་། །བྱེ་བྲག་ཀུན་ལ་སྦྱར་བར་བྱ།
en: And the perfect inner heat of union with another. These should be applied to all the above categories.

source: །གཅེར་བུ་ཤིན་ཏུ་གཅེར་བུ་དང་། །ཤིན་ཏུ་གཅེར་བུ་གཅེར་བུ་སོགས།
en: There are naked , very naked , very nakedly naked , and so forth;

source: །འདི་དག་ཀུན་ལ་སྦྱར་བར་བྱ།
en: All of these should be applied to each.

source: །དབྱེ་ན་རྣམ་པ་བཅུ་གཉིས་ཏེ།
en: Divided, there are twelve aspects

source: །ཡན་ལག་བཅུ་ཚན་བཞི་དང་བརྒྱད།
en: And branches, forty-eight in number.

source: །ས་སྤྱོད་མ་ཡི་རང་བཞིན་ཏེ།
en: This is the nature of earth-dwelling ḍākinī,

source: །སྟོང་ཕྲག་བདུན་ཅུ་རྩ་གཉིས་སོགས།
en: Seventy-two thousand, and so forth.

source: །གཞན་སྐྱེས་ཀྱི་ནི་ཁྲོ་མོ་ཙམ།
en: Mere fierce fire produced from elsewhere

source: །ཕྲ་བ་དེ་ལས་བཟློག་པའོ།
en: Is the antithesis of this subtle inner heat.

source: །བརྒྱ་དང་ཉི་ཤུ་སྐྲ་ཡི་རྩེ།
en: The tips of one hundred twenty hairs

source: །སུམ་ཅུ་རྩ་གཉིས་སྐྲ་ཡི་རྩེ།
en: And the tips of thirty-two hairs,

source: །ལྔ་ཡི་ཆ་སྟེ་གཙོ་བོ་གསུམ།
en: The five pairs and the three main ones:

source: །གསུམ་འདུས་ཡུངས་ཀར་གྱི་ནི་ཚད།
en: The place where these three unite is the size of a mustard seed.

source: །དབུས་དང་གཡས་གཡོན་ཕྲ་སྦོམ་དང་། །གཉིས་འགྱུར་བྱེ་བྲག་ཤེས་པར་བྱ། །དངས་མ་དང་ནི་སྙིགས་མའི་རྩར།
en: The relative widths of the central, right, and left, And the twofold distinctions should all be known.

source: །རང་བཞིན་དུ་ནི་གནས་པ་ལ།
en: There are places where they naturally reside As channels that are clear, and those that are impure.

source: །ཡི་གེ་ལྟ་བུའི་རྩ་མདུད་ཀྱང་།
en: Also, the channel knots, similar to letters:

source: །དང་པོའི་སྒྲ་རུ་གང་ཤེས་པ།
en: These are known as the primordial sound.

source: །ས་སྤྱོད་མ་ཡི་རང་བཞིན་ནོ།
en: They are the nature of the earth-dwelling ḍākinī.

source: །གནས་ལ་སོགས་པ་གཞན་ནས་ཤེས།
en: Learn their locations and so forth from other sources.

source: །འདི་ཉིད་ནོར་བུ་རིན་པོ་ཆེ།
en: These instructions are a precious jewel;

source: །འདི་ལ་བརྟེན་ནས་ཐམས་ཅད་འབྱུང་།
en: Everything arises in dependence on them.

source: །རིག་འཆོལ་གནས་འཆོལ་ཚད་འཆོལ་དང་། །དབྱིབས་དང་ཁ་དོག་གྲངས་ལ་སོགས།
en: There are mistaken lineages, mistaken placements, and mistaken measurements, Shapes, colors, numbers, and so forth.

source: །འཆོལ་པ་ལས་ནི་དངོས་གྲུབ་མིན།
en: There is no attainment from mistakes.

source: །དེ་ཉིད་བྲལ་བའི་རང་བཞིན་ནི།
en: The nature, which is free from those mistakes,

source: །ས་སྤྱོད་མ་ཡི་དངོས་གྲུབ་སྟེ།
en: Is the attainment of the earth-dwelling ḍākinī.

source: །ཐམས་ཅད་ཀུན་གྱི་རྟེན་ཡིན་ནོ།
en: She is the support for them all.

source: །ས་འོག་སྤྱོད་མའི་རང་བཞིན་ཏེ།
en: Next, the nature of the subterranean ḍākinī

source: །དེ་ནས་ཡང་དག་རབ་བཤད་པ།
en: Will be correctly and excellently explained.

source: །བྱང་ཆུབ་སེམས་ནི་རྣམ་པ་གསུམ།
en: There are three types of awakening mind.

source: །དང་པོ་ཆོས་ཉིད་སེམས་ཡིན་ཏེ།
en: The first is the suchness mind

source: །འདི་ནི་ཤེས་བརྗོད་ཡུལ་ལས་འདས།
en: This is beyond the scope of expressible knowledge.

source: །གཉིས་པ་རང་རིག་བྱང་ཆུབ་སེམས།
en: The second is the self-aware awakening mind

source: །དཔེར་ན་རྐྱེན་གྱིས་ཤེལ་སྒོང་བཞིན།
en: Like a crystal, its appearance is conditioned.

source: །གསུམ་པ་བེམས་པོའི་བྱང་ཆུབ་སེམས།
en: The third is the physical awakening mind

source: །སིཧླ་དང་ནི་ག་པུར་ཏེ།
en: Sandalwood and camphor.

source: །དོན་དམ་ཀུན་རྫོབ་གཉིས་སུ་གསུངས།
en: These are described in two ways: ultimate and conventional.

source: །ལས་ཀྱི་རླུང་དང་ལས་ཀྱི་མེས།
en: What moves by way of karmic winds and karmic fires

source: །གཡོ་བ་ཀུན་རྫོབ་བྱང་ཆུབ་སེམས།
en: Is conventional awakening mind.

source: །ཡེ་ཤེས་རླུང་དང་ཡེ་ཤེས་མེས།
en: What moves by way of wisdom winds and wisdom fires

source: །གཡོ་བ་དོན་དམ་སེམས་ཡིན་ཏེ།
en: Is the ultimate awakening mind.

source: །དངས་སྙིགས་ལས་ནི་རིམ་པ་ཡིན།
en: They have these stages, pure and impure. They should be distinguished

source: །དབྱིབས་དང་ཁ་དོག་ལས་ཀྱིས་ནི། །སེམས་ཀྱི་ཁྱད་པར་ཤེས་པར་བྱ།
en: Through shapes and through colors.

source: །ལས་ཀྱི་རླུང་གིས་མི་གཡོ་ཞིང་།
en: Not moving through the karmic winds,

source: །ལས་ཀྱི་མེ་ཡིས་མི་འཛག་པར།
en: Not burning through the karmic fires,

source: །ཁ་བ་ལྟ་བུའི་མཚན་ཉིད་ལས།
en: Its attributes are similar to snow;

source: །མི་ཤིགས་ཧྃ་གི་དབྱིབས་འདྲ་སྟེ།
en: The indestructible drop has the form of haṁ

source: །ནོར་བ་ཀུནྡའི་མདོག་ལྟ་བུ།
en: Like a jasmine-colored gem,

source: །དཀར་ལ་འཚེར་དང་གཟི་མདངས་སྣུམ།
en: Glossy-white and resplendent,

source: །བདེ་བ་ཆེན་པོའི་སྐུར་འབྱུང་བ།
en: It arises as the body of great bliss.

source: །འདི་ནི་དོན་དམ་བྱང་ཆུབ་སེམས།
en: This is the ultimate awakening mind.

source: །དམར་ལ་དངས་པའི་རང་བཞིན་ལ།
en: As for the red one, naturally clear,

source: །ཁྱད་པར་བཞི་ནི་ཐུན་མོང་སྟེ།
en: There are four common distinctions.

source: །འདི་ནི་ཤེས་རབ་བྱང་ཆུབ་སེམས།
en: These are wisdom, awakening mind,

source: །དེ་ལས་བཟློག་པའི་དམན་པ་གཉིས།
en: And the two inferior ones, which are their opposites.

source: །འོག་སྒོར་གནས་ཤིང་སྲིད་པ་སྐྱེ།
en: The latter two abide at the lower door; they give rise to cyclic existence

source: །དམན་པའི་རྐྱེན་གྱིས་གཡོ་བར་བྱེད།
en: When they are spurred to movement through negative conditions.

source: །དེ་ཕྱིར་དོན་དམ་ཀུན་རྫོབ་ཀྱིས།
en: Therefore, the attributes of the drops

source: །སེམས་ཀྱི་མཚན་ཉིད་ཤེས་པར་བྱ།
en: Must be known in their ultimate and their conventional aspects.

source: །རྒྱུ་འཆོལ་བ་ལས་དངོས་གྲུབ་མེད།
en: There is no attainment from mistaken causes,

source: །རྐྱེན་འཆོལ་བ་ལས་དེ་བཞིན་ཏེ།
en: Nor, likewise, from mistaken conditions.

source: །བླ་མའི་ཞལ་ནས་ཤེས་པར་བྱ།
en: These can be known from the teacher’s words.

source: །དོན་དམ་སེམས་ཀྱི་སྤྱོད་ཡུལ་མིན།
en: The ultimate is not an object engaged by the mind.

source: །ཀུན་རྫོབ་ཚོར་བ་བདེ་བའི་ཡུལ།
en: The conventional has the feeling of bliss as its object.

source: །ས་འོག་སྤྱོད་པའི་རང་བཞིན་ཏེ།
en: Its nature is the subterranean ḍākinī.

source: །རྡོ་རྗེ་གསུམ་བསྒོམ་མི་ཕྱེད་པ།
en: She is the unshakable meditation on the three vajras.

source: །དེ་ཉིད་རྡོ་རྗེ་སེམས་དཔའ་སྟེ།
en: She, herself, is Vajrasattva.

source: །ཡི་གེ་དང་ནི་ཡན་ལག་དང་། །བསྡུས་པའི་དོན་དང་སྤྱི་ཡི་དོན།
en: The meaning of the letters, the branches, The condensed meanings, the general meaning,

source: །སྦས་པའི་དོན་དང་མཐར་ཐུག་དོན།
en: The hidden meaning, and the ultimate meaning;

source: །སྣ་ཚོགས་སེམས་ལས་འབྱུང་བར་འགྱུར།
en: The varieties of conventional phenomena Arise from the mind.

source: །ནོར་བུ་དང་ནི་སིལ་སྙན་བཞིན།
en: Like a jewel and like a cymbal,

source: །རྟོག་མེད་རྟེན་ལས་སྣ་ཚོགས་འབྱུང་།
en: The varieties of ultimate phenomena Arise on the basis of nonconceptual awareness. The āli and kāli , along with the neuter phonemes,

source: །ཨཱ་ལི་ཀཱ་ལི་མ་ནིང་དང་། །དྲུག་ཏུ་སྦྱོར་བ་བརྟག་པར་བྱ།
en: Should be analyzed through these six modes.

source: །སྒྲ་མཐའི་ཡི་གེ་བསམ་མི་ཁྱབ།
en: The letter marking the final sound is inconceivable.

source: །ཡན་ལག་རྣམ་པ་གསུམ་ཡིན་ཏེ།
en: There are three types of branch:

source: །རྒྱུ་འབྲས་བརྡ་དང་བརྡ་ཅན་དང་། །བརྗོད་བྱ་དང་ནི་རྗོད་བྱེད་དོ།
en: Cause and result, signifier and signified, And expression and expressed.

source: །དེ་ལས་བཟློག་པ་བསྡུས་པར་བཤད།
en: To briefly explain their opposites:

source: །ཐེག་པ་གསུམ་དང་དེ་ལས་གཞན།
en: There are three vehicles; the rest is the mundane.

source: །ཐུན་མོང་སྤྱི་རུ་ངེས་པ་སྟེ།
en: These should be understood as common.

source: །བྱེ་བྲག་རང་ལས་ཤེས་པར་བྱ།
en: These divisions should be known for oneself.

source: །སྦས་པ་དབང་དང་སྔགས་སུ་དབྱེ།
en: The hidden comprises the classifications of initiations and mantras.

source: །སྔགས་ལ་བཞི་སྟེ་དབང་ལ་གཉིས།
en: There are four types of mantra and two kinds of initiation.

source: །ཆོས་ནི་སྤྱི་དང་བྱེ་བྲག་གོ།
en: Dharmas are of two types, general and particular.

source: །དེ་དག་ཀུན་གྱི་མཚན་ཉིད་ཀྱང་།
en: All these attributes

source: །སྣོད་དང་སྣོད་མིན་བྱེ་བྲག་ཀྱང་།
en: The types of fit and unfit vessels

source: །བླ་མས་ལེགས་པར་བརྟག་བྱ་སྟེ།
en: Should also be well analyzed by the guru.

source: །དེ་ཉིད་ཡང་དག་རྟོགས་གྱུར་ན།
en: When suchness is correctly realized,

source: །སྟོན་པ་མེད་ཅིང་བསྟན་པ་མེད།
en: There is no teacher, and nothing is taught.

source: །བསམ་གཏན་ལ་སོགས་འཇིག་པ་མེད།
en: Concentration and so forth become unceasing,

source: །སངས་རྒྱས་གཟུགས་ནི་སྣ་ཚོགས་འབྱུང་།
en: And buddhas arise in various forms.

source: །བྱ་བ་བཅུ་གཉིས་ལ་སོགས་པ། །ཆོས་ཀྱི་འཁོར་ལོ་སྣ་ཚོགས་བསྐོར། །དམན་པ་རྣམས་ལ་བྱ་བའི་རྒྱུད།
en: They turn the various wheels of the Dharma, Performing the twelve deeds and so forth. For the lesser disciples, there is Action Tantra

source: །བྱ་མེད་རྣལ་འབྱོར་དེ་ལྟག་ལ།
en: For the rest, there is Actionless Yoga

source: །དེ་རྗེས་རྣལ་འབྱོར་ཉིད་གསུངས་ཏེ།
en: After that, Yoga is also taught.

source: །རྣལ་འབྱོར་ནང་པ་དེ་ལྟག་ལ།
en: Inner yoga is for the rest.

source: །ཕྱི་ནས་རྣལ་འབྱོར་མ་རྒྱུད་ནི། །ཤེས་རབ་སྙིང་པོ་བརྩེར་གྱུར་པའི།
en: After that there is Yoginī Tantra

source: །ཐབས་དང་ཤེས་རབ་བསྲུབ་ཤིང་ལ།
en: Using the churning stick of method and insight, With the essence of wisdom at its tip,

source: །གཉིས་མེད་ཐུགས་ཀྱིས་བསྲུབས་པ་ལས།
en: The nondual awakened mind is churned;

source: །བདུད་རྩིའི་རོ་ནི་ཉི་ཤུ་བཞི།
en: From it comes nectar of twenty-four tastes.

source: །ནོར་བུ་རིན་ཆེན་རྒྱུད་ཅེས་བརྗོད།
en: This is known as the flow of precious jewels

source: །འཇིག་རྟེན་འཇིག་རྟེན་འདས་པ་ཡི།
en: From this, all mundane and supramundane

source: །དངོས་གྲུབ་ཐམས་ཅད་འདི་ལས་འབྱུང་།
en: Attainments will arise.

source: །ཇི་ལྟར་མ་དཀྲོགས་འོ་མ་ལས།
en: Just as unchurned milk

source: །འདོད་པ་གང་ཡང་འབྱུང་བ་མིན།
en: Will not give rise to what is desired,

source: །དེ་བཞིན་ལོ་གྲངས་མང་པོ་ལས།
en: Likewise, neither from many years of effort,

source: །དངོས་གྲུབ་མྱུར་དུ་འབྱུང་བ་མིན།
en: Nor suddenly, will attainments arise.

source: །དེ་ཕྱིར་རིན་ཆེན་ཉི་ཤུ་བཞི།
en: Therefore, there are twenty-four jewels,

source: །བདུད་རྩི་རོ་འདྲ་སེང་གེའི་གཟུགས།
en: Which taste like nectar and have the form of a lion.

source: །གནས་ནི་ཉི་ཤུ་བཞི་ཉིད་ཀྱང་།
en: Their sacred sites are also twenty-four,

source: །སྐུ་གསུང་ཐུགས་ཀྱིས་བྱིན་བརླབས་ཏེ།
en: Blessed by awakened body, speech, and mind.

source: །མཁའ་འགྲོ་ཉི་ཤུ་བཞི་ལ་གཏད།
en: Entrusted to twenty-four ḍākinīs,

source: །ཕྱག་རྒྱ་བཞི་ཡིས་རྒྱས་བཏབ་བོ།
en: They were sealed with four seals,

source: །དམ་དུ་སྦ་ཞིང་དམ་དུ་སྤེལ།
en: Carefully concealed and carefully disseminated.

source: །རྒྱ་ལས་འདས་ན་དམ་ཚིག་ཉམས།
en: If the seals are broken, the sacred vows are corrupted.

source: །སྔགས་དང་དབྱིབས་དང་ཆོས་བདག་ནི།
en: The natures of the mantras, visualized forms, and realizations

source: །སྐུ་གསུང་ཐུགས་ཀྱི་རང་བཞིན་ཏེ།
en: Are the natures of awakened body, speech, and mind.

source: །དེ་ཡི་ངོ་བོར་རྒྱུད་ཀུན་བརྟག །སྔགས་ལ་གཉིས་ཏེ་ཆོས་ལ་གཉིས།
en: These are constantly misconstrued as having an essence. There are two kinds of mantra, two kinds of realization.

source: །དབྱིབས་ཀྱང་དེ་བཞིན་ཤེས་པར་བྱ།
en: Visualized forms should be similarly understood in two ways.

source: །རེ་རེའི་བྱེ་བྲག་དབྱེ་བ་ཡང་།
en: The classifications and the divisions

source: །ཕྱི་ནང་སྦས་པ་མཐར་ཐུག་བཞི།
en: Outer, inner, hidden, and final—

source: །རྒྱུད་ཀུན་ཕྱག་རྒྱ་བཞི་ཡིན་ཏེ།
en: These are the four seals of all tantras.

source: །དེ་ཉིད་དབྱེ་བ་མཁས་པས་བརྟག །དེ་ཉིད་རྟོགས་ན་རྒྱུད་དང་ལྡན། །དེ་ལས་བཟློག་པ་འདས་པའོ།
en: This classification should be analyzed by the wise. When these are understood, The yogi possesses tantra, And hindrances are transcended.

source: །རང་བཞིན་གྱིས་ནི་ཙཎྜཱ་ལཱི།
en: This is natural caṇḍālī.

source: །གནས་ནི་ཉི་ཤུ་རྩ་བཞི་སྟེ།
en: There are twenty-four sacred sites,

source: །རྩ་གསུམ་གྱིས་ནི་བྱིན་གྱིས་བརླབས།
en: Blessed by the three channels.

source: །གནས་ནི་ཉི་ཤུ་རྩ་བཞི་རུ།
en: In these twenty-four sacred sites,

source: །མཁའ་འགྲོ་ཉི་ཤུ་རྩ་བཞི་ལ། །རྒྱུད་ནི་ཉི་ཤུ་རྩ་བཞི་གཏད།
en: To twenty-four ḍākinīs, twenty-four tantras were entrusted:

source: །པུ་རུ་རབ་གཏུམ་གསང་རྡོ་རྗེ།
en: Puru—very fierce secret vajra.

source: །ཛ་རུ་གཏུམ་མིག་གསང་བ་གཅོད།
en: Jaru—fierce eye, the secret is severed.

source: །ཨོ་རུ་འོད་ལྡན་བསམ་མི་ཁྱབ།
en: Oru—the bright one not pervaded by thought.

source: །ཨཱ་རུ་སྣ་རྩེ་ནམ་མཁའ་མཉམ།
en: Āru—the tip of the nose is equal to space.

source: །གོ་རུ་བསྟན་བློ་ནམ་མཁའ་ཆེ།
en: Goru—teaching the great space of the intellect.

source: །ར་རུ་མིའུ་ཐུང་སྐུ་གསུང་ཐུགས།
en: Raru—the body, speech, and mind of a dwarf.

source: །དེ་རུ་ལང་ཀ་རིན་ཆེན་ཕྲེང་།
en: Deru—Laṅka, jewel garland.

source: །མ་རུ་ཤིང་གྲིབ་དམ་ཚིག་ཆེ།
en: Maru—dark woods, great vow.

source: །ཀ་རུ་ཨེ་རཱུ་སྟོབས་པོ་ཆེ།
en: Karueru—great power.

source: །ཨོ་རུ་འཇིགས་བྱེད་ཡེ་ཤེས་གསང་།
en: Oru—terrifying secret wisdom.

source: །ཏྲི་རུ་རླུང་ཤུགས་ཡེ་ཤེས་ཕྲེང་།
en: Triru—powerful winds, wisdom garland.

source: །ཀོ་རུ་ཆང་འཐུང་ཡེ་ཤེས་འབར།
en: Koru—beer is consumed, wisdom blazes.

source: །ཀུ་རུ་ཤྱཱ་མ་ཟླ་བའི་ཕྲེང་།
en: Karuśyāma—garland of the moon.

source: །ལ་རུ་ཤིན་བཟང་རིན་ཆེན་འབར།
en: Laru—blazing with wealth and appeal.

source: །ཀ་རུ་རྟ་རྣ་ཉི་མའི་འཁོར།
en: Karu—horse-ear, the wheel of the sun.

source: །ཧེ་རུ་ཁ་ཁ་ཡེ་ཤེས་རྒྱལ།
en: Herukhakha—victorious wisdom.

source: །བྲེ་རུ་འཁོར་ཤུགས་མཁའ་འགྲོ་གསང་།
en: Preru—secret place of ḍākinīs’ strength.

source: །གྲྀ་རུ་ཁཎྜ་གསང་མེ་འབར།
en: Grīrukhaṇḍa—secret, blazing with fire.

source: །སཽ་རུ་ཤོཎྜི་གསང་བདུད་རྩི།
en: Saurushoṇḍi—secret nectar.

source: །སུ་རུ་འཁོར་ལོ་དུར་ཁྲོད་རྒྱན།
en: Suru—the wheel ornamented with a cemetery.

source: །ན་རུ་ཤིན་དཔའ་རྡོ་རྗེ་རྒྱལ།
en: Naru—very heroic victorious vajra.

source: །སི་རུ་སྟོབས་ཆེན་ཡེ་ཤེས་རྒྱལ།
en: Siru—great power and victorious wisdom.

source: །མ་རུ་འཁོར་སྒྱུར་ཆགས་པའི་རྒྱལ།
en: Maru—this area confers victory over attachment.

source: །ཀུ་རུ་བརྩོན་འགྲུས་མཁའ་འགྲོ་སྡོམ།
en: Kuru—enthusiastic ḍākinīs assemble. These are the places of entrustment;

source: །དེ་དག་གཏད་དོ་ལེགས་པར་སྦོས།
en: they should be sought out well.

source: །ནང་དུ་ཙཎྚཱ་ལཱི་དག་ནི། །ཉི་ཤུ་བཞི་ནི་གཏད་པ་སྟེ།
en: Regarding inner caṇḍālī, twenty-four were entrusted.

source: །དང་པོ་གསང་བ་གཉིས་པ་ཡང་། །རང་བཞིན་ཡིན་ཏེ་དེ་ནས་དབང་།
en: The first is secret, as is the second. These are the nature. Next comes empowerment.

source: །རྐྱེན་ནི་ཐ་མས་གསུངས་པ་སྟེ།
en: Last is conditions. So it was said.

source: །མཁའ་འགྲོ་ཁྱེད་ཀྱི་རང་བཞིན་ཏེ།
en: These are the specific natures of the ḍākinīs.

source: །དེ་ནས་དངོས་གྲུབ་གང་འདོད་སྦྱིན།
en: Any desired attainments will be bestowed.

source: །དངོས་གྲུབ་དམ་པ་གང་འདོད་པས།
en: One who wants the supreme attainments

source: །དབང་དང་དམ་ཚིག་ལྡན་བྱས་ཏེ།
en: Should receive initiation and sacred vows.

source: །རྟ་དང་གླང་པོ་ལ་སོགས་དང་། །བུ་དང་ཆུང་མ་ནོར་གྱི་དབྱིག །བསྙེན་བཀུར་དག་གིས་བསྙེན་བྱས་ཏེ།
en: With horses, elephants and so forth, One’s children and wife, One’s wealth and jewels, One should honor and serve the guru.

source: །བདུད་རྩི་རོ་ཡི་ར་ལི་ལས།
en: From ra and li , which are the taste of nectar,

source: །བླ་མའི་ཞལ་ནས་དངོས་གྲུབ་བླང་།
en: One attains realization from the instructions of the guru;

source: །ཡིད་ལ་ཟུང་ལ་དྲན་པར་གྱིས།
en: Remember to hold them in mind!

source: །དེ་ནས་འཁོར་འདུས་པ་དེ་དག་ཐམས་ཅད་རྗེས་སུ་ཡི་རང་བར་གྱུར་ཏོ།
en: Following this discourse, all the gathered assemblies that were present rejoiced.

source: །སྐུ་གསུང་ཐུགས་ཀྱི་རང་བཞིན་དཔལ་ནམ་མཁའ་དང་མཉམ་པའི་རྒྱུད་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་རྫོགས་སོ།།
en: This completes the glorious king of tantras “Equal to the Sky,” which has the nature of awakened body, speech, and mind.

source: །།པཎྜི་ཏ་ག་ཡ་དྷ་ར་དང་། དགེ་སློང་ཤཱཀྱ་ཡེ་ཤེས་ཀྱིས་ཞུས་ཤིང་བསྒྱུར་བའོ།། །།
en: This was translated and edited by the paṇḍita Gayādhara and the monk Śākya Yeshé.
